Repository: Timosha/itas
Catalog: po/*.po
Languages: he

source: Supports site internationalization (i18n).
he: תומך באתרים רב לשוניים (i18n).

source: edit %language
he: ערוך %language

source: Interface translation
he: תרגום ממשק

source: Disabled
he: מבוטל

source: Enabled
he: מאופשר

source: Content translation
he: תרגום תוכן

source: Synchronize content
he: שילוב תוכן

source: Front page
he: עמוד ראשי

source: Default
he: ברירת מחדל

source: Language dependant
he: תלוי שפה

source: Keep Language
he: שמור שפה

source: Cookie
he: עוגייה

source: Detect browser language
he: זיהוי שפת הדפדפן

source: Flags directory
he: ספריית דגלים

source: Languages
he: שפות

source: i18n
he: אתר רב לשוני

source: Language
he: שפה

source: Save
he: שמור

source: This language will be set for all terms in this vocabulary
he: זו השפה שתוגדר עבור כל הנושאים במילון זה

source: Multilingual support
he: תמיכה רב לשונית

source: Enables language field and multilingual support for this content type.
he: איפשור שדה השפה והתמיכה הרב לשונית עבור סוג תוכן זה.

source: If you change the Language, you must click on <i>Preview</i> to get the right Categories &amp; Terms for that language.
he: לאחר שינוי השפה, יש ללחוץ על <i>תצוגה מקדימה</i> כדי להציג את הסיווגים והנושאים המתאימים עבור השפה.

source: Reset language for all terms.
he: איתחול השפה עבור כל הנושאים.

source: Language switcher
he: החלפת שפה

source: Supports translatable custom menu items. <b>Requires i18n and locale module</b>
he: תומך בתפריטים הניתנים לתרגום. <b>דורש את הרכיבים i18n ו-locale</b>.

source: i18nmenu
he: תפריטים בריבוי שפות

source: Manages translations between nodes and taxonomy terms. <b>Requires i18n module</b>
he: ניהול תרגומים של פריטי תוכן ונושאים במילונים. <b>דורש את רכיב i18n</b>.

source: <h2>Translations</h2>
he: <h2>תרגומים</h2>

source: translation
he: תרגום

source: Language Management
he: ניהול שפות

source: Interface language depends on content.
he: שפת הממשק תלויה בתוכן

source: Interface language is independent
he: שפת הממשק אינה תלויה בתוכך

source: How interface language and content language are managed.
he: איך לנהל את שפת הממשק ושפת התוכן

source: Links to node translations
he: קישורים לתרגומים של פריטי תוכן

source: None.
he: ללא

source: Main page only
he: בעמוד הפירוט בלבד

source: Teaser and Main page
he: בתקציר ובעמוד הפירוט

source: Translations
he: תרגומים

source: Language and translations
he: שפה ותרגומים

source: Remove
he: הסר

source: <h2>Current translations</h2>
he: <h2>תרגומים נוכחיים</h2>

source: Title
he: כותרת

source: Options
he: אפשרויות

source: Not translated
he: לא תורגם

source: create translation
he: צור תרגום

source: select node
he: בחר פריט תוכן

source: Remove node from this translation set
he: הסר את פריט התוכן מקבוצת תרגום זו

source: Select translation for %language
he: בחר תרגום ל%language

source: <p>No nodes available in %language</p>
he: <p>אין פריטי תוכן זמינים ב%language</p>

source: The translation has been saved
he: התרגום נשמר

source: Removed translation information from term
he: הוסר המידע על התרגום מנושא זה

source: Edit term translations
he: ערוך את התרגומים של הנושא

source: Submit
he: הגש

source: Operations
he: פעולות

source: edit
he: ערוך

source: new translation
he: תרגום חדש

source: Term translations have been updated
he: תרגום הנושא עודכן
