Repository: Timosha/itas
Catalog: po/i18n-*.po
Languages: fr

source: <p>This module provides support for internationalization of Drupal sites in various ways:</p> <ul><li>Translation of the user interface for registered and anonymous users</li> <li>Multi-language for content, combined with url aliasing. For this feature to be used, you must enable it in the module configuration and then use url aliasing to keep pages in various languages. I.e. 'en/mypage', 'es/mypage' should be English and Spanish versions of the same page</li> <li>Detection of the brower language</li> <li>Keeps the language settings accross consecutive requests, using a number of methods: URL rewriting, sessions, cookies</li> <li>Provides a block for language selection and two theme functions: <i>i18n_flags</i> and <i>i18n_links</i></li></ul> <p>For url rewriting you need to have the file <b>i18n.inc</b> in the <i>includes</i> folder and add the following line to your configuration file:</p> <pre> include 'includes/i18n.inc'; </pre> <p>You can try different settings to have only content translation, interface translation or both.</p> <p><small>Module developed by <a href="http://freelance.reyero.net">freelance.reyero.net</a></small></p>
fr: <p>Ce module apporte un support à l'internationalisation de plusieurs façons:</p> <ul><li>Traduction de l'interface utilisateur pour utilisateurs enregistrés et anonymes</li> <li>Multi-langage pour les contenus, combiné avec les alias d'url. Pourutiliser cette fonction, vous devez le permettre dans la configuration de module et utiliser ensuite l'alias d'url pour tenir des pages dans des langues diverses. C'est-à-dire 'en/mypage', 'es/mypage' devrait être les versions anglaises et espagnoles de la même page</li> <li>Détection de la langue du navigateur</li> <li>Conserve les paramètres de langue au travers de demandes consécutives, utilisant un certain nombre de méthodes : réecriture d'URL, sessions, cookies</li> <li>Fournit un bloc pour le choix de langue et deux fonctions de thème : <i>i18n_flags</i> and <i>i18n_links</i></li></ul> <p>Pour la réecriture d'url vous devez avoir le fichier <b> i18n.inc </b> dans le dossier <i>includes</i> et ajouter la ligne suivante à votre fichier de configuration :</p> <pre> include 'includes/i18n.inc'; </pre> <p>Vous pouvez essayer différents paramètres pour avoir seulement la traduction des contenus, la traduction d'interface ou les deux.</p> <p><small>Module developpé par <a href="http://freelance.reyero.net">freelance.reyero.net</a></small></p>

source: Supports site internationalization (i18n).
fr: Appui à l'internationalisation des sites (i18n).

source: edit %language
fr: éditer %language

source: Interface translation
fr: Traduction de l'interface

source: Disabled
fr: Désactivé

source: Enabled
fr: Activé

source: If disabled, uses Drupal's default. If enabled, translates the interface to selected language
fr: Si désactivée, utilise la configuration par défaut de Drupal. Si permis, traduit l'interface dans la langue choisie

source: Content translation
fr: Traduction de contenus

source: If enabled, prepends language code to url and searches for translated content
fr: Si activé, préfixe le code de langue à l'url et recherches les contenus traduits

source: Synchronize content
fr: Synchronise les contenus

source: Nodes
fr: Noeuds

source: Taxonomy
fr: Catégorisation

source: Synchronize tables for different languages. When some element is created/removed, it will be created/removed for all languages with the same id
fr: Synchronisez des tables pour des langues différentes. Quand un élément est créé/enlevé, il sera créé/enlevé pour toutes les langues avec le même id

source: Front page
fr: Page d'accueil

source: Default
fr: par défaut

source: Language dependant
fr: Dépendant du langage

source: If language dependant and <i>Content translation</i> is enabled, default front page will be prepended with language code, i.e. 'en/node'
fr: Si la dépendance de langage et <i> la traduction de contenus</i> sont activés, la page d'accueil par défaut sera préfixée avec le code de langue, par ex. : en/node'

source: Keep Language
fr: Concerve la langue

source: URL rewriting
fr: Réecriture d'URL

source: A language code independent of user's language will be kept accross requests using the selected method
fr: Un code de langue indépendant de la langue de l'utilisateur sera conservé à travers less demandes utilisant la méthode choisie

source: Detect browser language
fr: Détecte le langage du navigateur

source: Flags directory
fr: Marque un dossier d'un drapeau

source: Path for flags. Asterisk '*' is a placeholder for language code. This is only needed when you want a language selector block
fr: Chemin pourles drapeaux. L'astérisque '*' est un joker pour le code de langue. C'est nécessaire seulement quand vous voulez un bloc de sélecteur de langue

source: Languages
fr: Langues
